document.write(`1. Значення константи е = 2.718281828459045
<br>2. Значення константи π = 3.141592653589793
<br>3. Десятковий логарифм постійної Ейлера (е) = 0.4342944819032518
<br>4. Двійковий логарифм постійної Ейлера (е) = 1.4426950408889634
<br>5. Натуральний логарифм числа 10 = 2.302585092994046
<br>6. Натуральний логарифм числа 2 = 0.6931471805599453
<br>7. Корінь квадратний із двох = 1.4142135623730951
<br>8. Корінь квадратний з однієї другої = 0.7071067811865476 <br><br>`);

var y1 = Math.acos(0);
document.write("Результат обчислення арктангенса нуля: y = " + y1 + "<br>");

var y2 = Math.sin(0);
document.write("Результат обчислення синуса нуля радіан: y = " + y2 + "<br>");

var y3 = Math.sin(Math.PI / 2);
document.write("Синус 90 градусів (π /2 радіан): y = " + y3 + "<br>");

var y4 = Math.asin(1);
document.write("Результат обчислення арксинуса одиниці: y = " + y4 + "<br>");

var y5 = Math.tan(Math.PI / 4);
document.write("Тангенс 45 градусів (π /4 радіан): y = " + y5);


document.write(`<br><br>`+Math.random());